liuhw0/pyOCD/pyocd/debug/svd/data/FM33LG0XX.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VREF</name>
      <description>VREF module information</description>
      <groupName>VREF</groupName>
      <baseAddress>0x4001a400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VREF</name>
        <description>VREF interrupt</description>
        <value>29</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>VREF Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PTAT_EN</name>
              <description>PTAT_EN field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREF_EN</name>
              <description>VREF_EN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>VREF Config Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST_DELAY</name>
              <description>ST_DELAY field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>VREF Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLAG_B</name>
              <description>FLAG_B field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDY</name>
              <description>RDY field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IF</name>
              <description>IF field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>VREF Interrupt Enable Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFCR</name>
          <displayName>BUFCR</displayName>
          <description>Buffer Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AVREFBUF_OUTEN</name>
              <description>AVREFBUF_OUTEN field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AVREFBUF_EN</name>
              <description>AVREFBUF_EN field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPTATBUFFER_OUTEN</name>
              <description>VPTATBUFFER_OUTEN field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPTATBUFFER_EN</name>
              <description>VPTATBUFFER_EN field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFFER_OUTEN</name>
              <description>VREFBUFFER_OUTEN field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFFER_EN</name>
              <description>VREFBUFFER_EN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VAO</name>
      <description>VAO module information</description>
      <groupName>VAO</groupName>
      <baseAddress>0x4001f000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xc1c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RST_CR</name>
          <displayName>RST_CR</displayName>
          <description>VBAT Reset Control Register</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VBAT_RST</name>
              <description>VBAT_RST field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XTLF_CR</name>
          <displayName>XTLF_CR</displayName>
          <description>XTLF Control Register</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XTLFEN</name>
              <description>XTLFEN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XTLF_PR</name>
          <displayName>XTLF_PR</displayName>
          <description>XTLF Power Register</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>DRVCFG</name>
              <description>DRVCFG field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>XTLFIPW</name>
              <description>XTLFIPW field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FD_IER</name>
          <displayName>FD_IER</displayName>
          <description>XTLF Oscillation Fail Detection Interrupt Enable Register</description>
          <addressOffset>0x80c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFDET_IE</name>
              <description>LFDET_IE field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FD_ISR</name>
          <displayName>FD_ISR</displayName>
          <description>XTLF Oscillation Fail Detection Interrupt Status Register</description>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFDETO</name>
              <description>LFDETO field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFDETIF</name>
              <description>LFDETIF field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INEN</name>
          <displayName>INEN</displayName>
          <description>VAO IO Input Enable Register</description>
          <addressOffset>0xc00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHINEN</name>
              <description>PHINEN field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUEN</name>
          <displayName>PUEN</displayName>
          <description>VAO IO Pull-up Enable Register</description>
          <addressOffset>0xc04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHPUEN</name>
              <description>PHPUEN field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODEN</name>
          <displayName>ODEN</displayName>
          <description>VAO IO Open Drain Enable Register</description>
          <addressOffset>0xc08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHODEN</name>
              <description>PHODEN field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <displayName>FCR</displayName>
          <description>VAO IO Function Control Register</description>
          <addressOffset>0xc0c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHFCR</name>
              <description>PHFCR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR</name>
          <displayName>DOR</displayName>
          <description>VAO IO Data Output Register</description>
          <addressOffset>0xc10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHDO</name>
              <description>PHDO field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR</name>
          <displayName>DIR</displayName>
          <description>VAO IO Data Input Register</description>
          <addressOffset>0xc14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHDIN</name>
              <description>PHDIN field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VILR</name>
          <displayName>VILR</displayName>
          <description>VAO IO Voltage Input Low Register</description>
          <addressOffset>0xc18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHVIL</name>
              <description>PHVIL field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
