liuhw0/pyOCD/pyocd/debug/svd/data/FM33LG0XX.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMU</name>
      <description>CMU module information</description>
      <groupName>CMU</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FDET</name>
        <description>FDET interrupt</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>CCL</name>
        <description>CCL interrupt</description>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>SYSCLKCR</name>
          <displayName>SYSCLKCR</displayName>
          <description>System Clock Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0a000000</resetValue>
          <fields>
            <field>
              <name>LSCATS</name>
              <description>LSCATS field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLP_ENEXTI</name>
              <description>SLP_ENEXTI field description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APBPRES</name>
              <description>APBPRES field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AHBPRES</name>
              <description>AHBPRES field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>STCLKSEL</name>
              <description>STCLKSEL field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYSCLKSEL</name>
              <description>SYSCLKSEL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCHCR</name>
          <displayName>RCHCR</displayName>
          <description>RCHF Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>FSEL</name>
              <description>FSEL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RCHFEN</name>
              <description>RCHFEN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCHTR</name>
          <displayName>RCHTR</displayName>
          <description>RCHF Trim Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>RCHFTRIM</name>
              <description>RCHFTRIM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCR</name>
          <displayName>PLLCR</displayName>
          <description>PLL Control Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <resetValue>0x001f0000</resetValue>
          <fields>
            <field>
              <name>PLLDB</name>
              <description>PLLDB field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKED</name>
              <description>LOCKED field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REFPRSC</name>
              <description>REFPRSC field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLOSEL</name>
              <description>PLLOSEL field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLINSEL</name>
              <description>PLLINSEL field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLEN</name>
              <description>PLLEN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCLPCR</name>
          <displayName>RCLPCR</displayName>
          <description>RCLP Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENB</name>
              <description>ENB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCLPTR</name>
          <displayName>RCLPTR</displayName>
          <description>RCLP Trim Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>RCLP_TRIM</name>
              <description>RCLP_TRIM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LSCLKSEL</name>
          <displayName>LSCLKSEL</displayName>
          <description>LSCLK Select Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSCLKSEL</name>
              <description>LSCLKSEL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XTHCR</name>
          <displayName>XTHCR</displayName>
          <description>XTHF Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HF_CFG</name>
              <description>HF_CFG field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>XTHFEN</name>
              <description>XTHFEN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCLFCR</name>
          <displayName>RCLFCR</displayName>
          <description>RCLF Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RCLF_PSC</name>
              <description>RCLF_PSC field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RCLF_EN</name>
              <description>RCLF_EN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCLFTR</name>
          <displayName>RCLFTR</displayName>
          <description>RCLF Trim Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>RCLF_TRIM</name>
              <description>RCLF_TRIM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYSCKE_IE</name>
              <description>SYSCKE_IE field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HFDET_IE</name>
              <description>HFDET_IE field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>Interrupt Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HFDETO</name>
              <description>HFDETO field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCSE_IF</name>
              <description>SYSCSE_IF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFDETIF</name>
              <description>HFDETIF field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKCR1</name>
          <displayName>PCLKCR1</displayName>
          <description>Peripheral bus Clock Control Register1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>VREF1p2_PCE</name>
              <description>VREF1p2_PCE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA_PCE</name>
              <description>OPA_PCE field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATT_PCE</name>
              <description>ATT_PCE field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP_PCE</name>
              <description>COMP_PCE field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SVD_PCE</name>
              <description>SVD_PCE field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAD_PCE</name>
              <description>PAD_PCE field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDT_PCE</name>
              <description>IWDT_PCE field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCU_PCE</name>
              <description>SCU_PCE field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMU_PCE</name>
              <description>PMU_PCE field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCA_PCE</name>
              <description>RTCA_PCE field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPT16_PCE</name>
              <description>LPT16_PCE field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPT32_PCE</name>
              <description>LPT32_PCE field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKCR2</name>
          <displayName>PCLKCR2</displayName>
          <description>Peripheral bus Clock Control Register2</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PGL_PCE</name>
              <description>PGL_PCE field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC_PCE</name>
              <description>DAC_PCE field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVAS_PCE</name>
              <description>DIVAS_PCE field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC_PCE</name>
              <description>ADC_PCE field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDT_PCE</name>
              <description>WWDT_PCE field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMBIST_PCE</name>
              <description>RAMBIST_PCE field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASH_PCE</name>
              <description>FLASH_PCE field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_PCE</name>
              <description>DMA_PCE field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCD_PCE</name>
              <description>LCD_PCE field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES_PCE</name>
              <description>AES_PCE field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNG_PCE</name>
              <description>TRNG_PCE field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_PCE</name>
              <description>CRC_PCE field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKCR3</name>
          <displayName>PCLKCR3</displayName>
          <description>Peripheral bus Clock Control Register3</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C_PCE</name>
              <description>I2C_PCE field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN_PCE</name>
              <description>CAN_PCE field description</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART2_PCE</name>
              <description>LPUART2_PCE field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1_PCE</name>
              <description>LPUART1_PCE field description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART0_PCE</name>
              <description>LPUART0_PCE field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>U7816_PCE</name>
              <description>U7816_PCE field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UARTIR_PCE</name>
              <description>UARTIR_PCE field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART5_PCE</name>
              <description>UART5_PCE field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART4_PCE</name>
              <description>UART4_PCE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART3_PCE</name>
              <description>UART3_PCE field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART1_PCE</name>
              <description>UART1_PCE field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART0_PCE</name>
              <description>UART0_PCE field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2_PCE</name>
              <description>SPI2_PCE field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1_PCE</name>
              <description>SPI1_PCE field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI0_PCE</name>
              <description>SPI0_PCE field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKCR4</name>
          <displayName>PCLKCR4</displayName>
          <description>Peripheral bus Clock Control Register4</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BT16_PCE</name>
              <description>BT16_PCE field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AT_PCE</name>
              <description>AT_PCE field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GT2_PCE</name>
              <description>GT2_PCE field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GT1_PCE</name>
              <description>GT1_PCE field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GT0_PCE</name>
              <description>GT0_PCE field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BT32_PCE</name>
              <description>BT32_PCE field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
