liuhw0/pyOCD/pyocd/debug/svd/data/FM33LG0XX.svd
        <register>
          <name>HPB_DW1R</name>
          <displayName>HPB_DW1R</displayName>
          <description>CAN TX HPB Data Word1 Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB3</name>
              <description>DB3 field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB2</name>
              <description>DB2 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB1</name>
              <description>DB1 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB0</name>
              <description>DB0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HPB_DW2R</name>
          <displayName>HPB_DW2R</displayName>
          <description>CAN TX HPB Data Word2 Register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB7</name>
              <description>DB7 field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB6</name>
              <description>DB6 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB5</name>
              <description>DB5 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB4</name>
              <description>DB4 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF_IDR</name>
          <displayName>RXF_IDR</displayName>
          <description>CAN RX FIFO ID Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDR</name>
              <description>IDR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF_DLCR</name>
          <displayName>RXF_DLCR</displayName>
          <description>CAN RX FIFO DLC Register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF_DW1R</name>
          <displayName>RXF_DW1R</displayName>
          <description>CAN RX FIFO Data Word1 Register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB3</name>
              <description>DB3 field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB2</name>
              <description>DB2 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB1</name>
              <description>DB1 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB0</name>
              <description>DB0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF_DW2R</name>
          <displayName>RXF_DW2R</displayName>
          <description>CAN RX FIFO Data Word2 Register</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB7</name>
              <description>DB7 field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB6</name>
              <description>DB6 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB5</name>
              <description>DB5 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DB4</name>
              <description>DB4 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFR</name>
          <displayName>AFR</displayName>
          <description>Acceptance Filter Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UAF4</name>
              <description>UAF4 field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UAF3</name>
              <description>UAF3 field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UAF2</name>
              <description>UAF2 field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UAF1</name>
              <description>UAF1 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR0</name>
          <displayName>AFMR0</displayName>
          <description>Acceptance Filter Mask Register1</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMID1</name>
              <description>AMID1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMID0</name>
              <description>AMID0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR0</name>
          <displayName>AFIR0</displayName>
          <description>Acceptance Filter ID Register1</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIID1</name>
              <description>AIID1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIID0</name>
              <description>AIID0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR1</name>
          <displayName>AFMR1</displayName>
          <description>Acceptance Filter Mask Register2</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMID1</name>
              <description>AMID1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMID0</name>
              <description>AMID0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR1</name>
          <displayName>AFIR1</displayName>
          <description>Acceptance Filter ID Register2</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIID1</name>
              <description>AIID1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIID0</name>
              <description>AIID0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR2</name>
          <displayName>AFMR2</displayName>
          <description>Acceptance Filter Mask Register3</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMID1</name>
              <description>AMID1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMID0</name>
              <description>AMID0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR2</name>
          <displayName>AFIR2</displayName>
          <description>Acceptance Filter ID Register3</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIID1</name>
              <description>AIID1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIID0</name>
              <description>AIID0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR3</name>
          <displayName>AFMR3</displayName>
          <description>Acceptance Filter Mask Register4</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMID1</name>
              <description>AMID1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMID0</name>
              <description>AMID0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR3</name>
          <displayName>AFIR3</displayName>
          <description>Acceptance Filter ID Register4</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIID1</name>
              <description>AIID1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIID0</name>
              <description>AIID0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
