liuhw0/pyOCD/pyocd/debug/svd/data/FM33LG0XX.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x40000c40</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <baseAddress>0x40000c80</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD</name>
      <baseAddress>0x40000cc0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE</name>
      <baseAddress>0x40000d00</baseAddress>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <description>GPIO module information</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40000dc0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x144</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WKUPX</name>
        <description>WKUPX interrupt</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>EXTI</name>
        <description>EXTI interrupt</description>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>EXTISEL0</name>
          <displayName>EXTISEL0</displayName>
          <description>External Interrupt Input Select Register0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_DSEL</name>
              <description>EXTI_DSEL field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_CSEL</name>
              <description>EXTI_CSEL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_BSEL</name>
              <description>EXTI_BSEL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_ASEL</name>
              <description>EXTI_ASEL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISEL1</name>
          <displayName>EXTISEL1</displayName>
          <description>External Interrupt Input Select Register1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_ESEL</name>
              <description>EXTI_ESEL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDS0</name>
          <displayName>EXTIEDS0</displayName>
          <description>External Interrupt Edge Select and Enable Register0</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDS1</name>
          <displayName>EXTIEDS1</displayName>
          <description>External Interrupt Edge Select and Enable Register1</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003f</resetValue>
          <fields>
            <field>
              <name>EXTI18_EDS</name>
              <description>EXTI18_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI17_EDS</name>
              <description>EXTI17_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI16_EDS</name>
              <description>EXTI16_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIDF</name>
          <displayName>EXTIDF</displayName>
          <description>External Interrupt Digital Filter Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_DF18</name>
              <description>EXTI_DF18 field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF17</name>
              <description>EXTI_DF17 field description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF16</name>
              <description>EXTI_DF16 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF15</name>
              <description>EXTI_DF15 field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF14</name>
              <description>EXTI_DF14 field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF13</name>
              <description>EXTI_DF13 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF12</name>
              <description>EXTI_DF12 field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF11</name>
              <description>EXTI_DF11 field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF10</name>
              <description>EXTI_DF10 field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF9</name>
              <description>EXTI_DF9 field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF8</name>
              <description>EXTI_DF8 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF7</name>
              <description>EXTI_DF7 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF6</name>
              <description>EXTI_DF6 field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF5</name>
              <description>EXTI_DF5 field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF4</name>
              <description>EXTI_DF4 field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF3</name>
              <description>EXTI_DF3 field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF2</name>
              <description>EXTI_DF2 field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF1</name>
              <description>EXTI_DF1 field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DF0</name>
              <description>EXTI_DF0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIISR</name>
          <displayName>EXTIISR</displayName>
          <description>External Interrupt and Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI18</name>
              <description>EXTI18 field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI17</name>
              <description>EXTI17 field description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI16</name>
              <description>EXTI16 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI15</name>
              <description>EXTI15 field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI14</name>
              <description>EXTI14 field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI13</name>
              <description>EXTI13 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI12</name>
              <description>EXTI12 field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI11</name>
              <description>EXTI11 field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI10</name>
              <description>EXTI10 field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI9</name>
              <description>EXTI9 field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI8</name>
              <description>EXTI8 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI7</name>
              <description>EXTI7 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI6</name>
              <description>EXTI6 field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI5</name>
              <description>EXTI5 field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI4</name>
              <description>EXTI4 field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI3</name>
              <description>EXTI3 field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI2</name>
              <description>EXTI2 field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI1</name>
              <description>EXTI1 field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI0</name>
              <description>EXTI0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIDI</name>
          <displayName>EXTIDI</displayName>
          <description>External Interrupt Data Input Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_DI18</name>
              <description>EXTI_DI18 field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI17</name>
              <description>EXTI_DI17 field description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI16</name>
              <description>EXTI_DI16 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI15</name>
              <description>EXTI_DI15 field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI14</name>
              <description>EXTI_DI14 field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI13</name>
              <description>EXTI_DI13 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI12</name>
              <description>EXTI_DI12 field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI11</name>
              <description>EXTI_DI11 field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI10</name>
              <description>EXTI_DI10 field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI9</name>
              <description>EXTI_DI9 field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI8</name>
              <description>EXTI_DI8 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI7</name>
              <description>EXTI_DI7 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI6</name>
              <description>EXTI_DI6 field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI5</name>
              <description>EXTI_DI5 field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI4</name>
              <description>EXTI_DI4 field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI3</name>
              <description>EXTI_DI3 field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI2</name>
              <description>EXTI_DI2 field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI1</name>
              <description>EXTI_DI1 field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI_DI0</name>
              <description>EXTI_DI0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FOUTSEL</name>
          <displayName>FOUTSEL</displayName>
          <description>Frequency Output Select Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FOUT1SEL</name>
              <description>FOUT1SEL field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FOUT0SEL</name>
              <description>FOUT0SEL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
