liuhw0/pyOCD/pyocd/debug/svd/data/FM33LG0XX.svd
        <register>
          <name>PINWKEN</name>
          <displayName>PINWKEN</displayName>
          <description>Wakeup Enable Register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKSEL</name>
              <description>WKSEL field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKSEL9</name>
              <description>PINWKSEL9 field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL8</name>
              <description>PINWKSEL8 field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL7</name>
              <description>PINWKSEL7 field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL6</name>
              <description>PINWKSEL6 field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL5</name>
              <description>PINWKSEL5 field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL4</name>
              <description>PINWKSEL4 field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL3</name>
              <description>PINWKSEL3 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL2</name>
              <description>PINWKSEL2 field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL1</name>
              <description>PINWKSEL1 field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKSEL0</name>
              <description>PINWKSEL0 field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINWKEN9</name>
              <description>PINWKEN9 field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN8</name>
              <description>PINWKEN8 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN7</name>
              <description>PINWKEN7 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN6</name>
              <description>PINWKEN6 field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN5</name>
              <description>PINWKEN5 field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN4</name>
              <description>PINWKEN4 field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN3</name>
              <description>PINWKEN3 field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN2</name>
              <description>PINWKEN2 field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN1</name>
              <description>PINWKEN1 field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKEN0</name>
              <description>PINWKEN0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <description>DBG module information</description>
      <groupName>DBG</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xc</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SYSCFG</name>
          <displayName>SYSCFG</displayName>
          <description>no description</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000ff00</resetValue>
          <fields>
            <field>
              <name>LDT0FAIL</name>
              <description>LDT0FAIL field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDT1FAIL</name>
              <description>LDT1FAIL field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCTFAIL</name>
              <description>DCTFAIL field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RED_INFO</name>
              <description>RED_INFO field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RAMCFG</name>
              <description>RAMCFG field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLSCFG</name>
              <description>FLSCFG field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUDBGCR</name>
          <displayName>MCUDBGCR</displayName>
          <description>no description</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000ff03</resetValue>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <description>DBG_SLEEP field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPT16_STOP</name>
              <description>DBG_LPT16_STOP field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_BT16_STOP</name>
              <description>DBG_BT16_STOP field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_AT_STOP</name>
              <description>DBG_AT_STOP field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPT32_STOP</name>
              <description>DBG_LPT32_STOP field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GT2_STOP</name>
              <description>DBG_GT2_STOP field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GT1_STOP</name>
              <description>DBG_GT1_STOP field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GT0_STOP</name>
              <description>DBG_GT0_STOP field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_BT32_STOP</name>
              <description>DBG_BT32_STOP field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_WWDT_STOP</name>
              <description>DBG_WWDT_STOP field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_IWDT_STOP</name>
              <description>DBG_IWDT_STOP field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDFFLAG</name>
          <displayName>HDFFLAG</displayName>
          <description>no description</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DABORT_ADDR_FLAG</name>
              <description>DABORT_ADDR_FLAG field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DABORT_RESP_FLAG</name>
              <description>DABORT_RESP_FLAG field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SVCUNDEF_FLAG</name>
              <description>SVCUNDEF_FLAG field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPT_FLAG</name>
              <description>BKPT_FLAG field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBIT_FLAG</name>
              <description>TBIT_FLAG field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPECIAL_OP_FLAG</name>
              <description>SPECIAL_OP_FLAG field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDF_REQUEST_FLAG</name>
              <description>HDF_REQUEST_FLAG field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>